import { IProductDto } from "~/types/Product";

export const allProducts: Array<IProductDto> = [
    {
        name: "Сайдинг NordSide Лапландия 3,05 х 0,205м Белый",
        images: ["https://st37.stpulscen.ru/images/product/453/075/072_medium3.webp", "https://st16.stpulscen.ru/images/product/438/105/476_original.jpg"],
        price: 215,
        stock: 1,
        discount: 15,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Белый"],
            ["Материал", "Виниловый"],
            ["Имитация", "Корабельная доска"],
            ["Длина,мм", "3050"],
            ["Ширина,мм", "205"]
        ]
    },
    {
        name: "Сайдинг NordSide Лапландия 3,05 х 0,205м Ламантин",
        images: ["https://st16.stpulscen.ru/images/product/438/105/479_medium3.jpg"],
        price: 215,
        stock: 1,
        discount: 15,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Ламантин"],
            ["Материал", "Виниловый"],
            ["Имитация", "Корабельная доска"],
            ["Длина,мм", "3050"],
            ["Ширина,мм", "205"]
        ]
    },
    {
        name: "Сайдинг NordSide Лапландия 3,05 х 0,205м Магнолия",
        images: ["https://st16.stpulscen.ru/images/product/438/105/481_medium3.jpg"],
        price: 215,
        stock: 1,
        discount: 15,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Магнолия"],
            ["Материал", "Виниловый"],
            ["Имитация", "Корабельная доска"],
            ["Длина,мм", "3050"],
            ["Ширина,мм", "205"]
        ]
    },
    {
        name: "Сайдинг NordSide Лапландия 3,05 х 0,205м Маисовый",
        images: ["https://st16.stpulscen.ru/images/product/438/105/484_medium3.jpg", "https://siding-plus.ru/d/vilo_pesochnyj6.jpg"],
        price: 215,
        stock: 1,
        discount: 15,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Маисовый"],
            ["Материал", "Виниловый"],
            ["Имитация", "Корабельная доска"],
            ["Длина,мм", "3050"],
            ["Ширина,мм", "205"]
        ]
    },
    {
        name: "Сайдинг NordSide Лапландия 3,05 х 0,205м Миртовый",
        images: ["https://st16.stpulscen.ru/images/product/438/105/488_medium3.jpg", "https://bspol.ru/sites/default/files/styles/400x340/public/vinilovovyy_sayding_nordside_laplandiya_mirtovyy_1.jpg?itok=4mA8EkXF"],
        price: 215,
        stock: 1,
        discount: 15,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Миртовый"],
            ["Материал", "Виниловый"],
            ["Имитация", "Корабельная доска"],
            ["Длина,мм", "3050"],
            ["Ширина,мм", "205"]
        ]
    },
    {
        name: "Сайдинг NordSide Лапландия 3,05 х 0,205м Шафран",
        images: ["https://cs.petrovich.ru/image/21993772/original.jpg", "https://bspol.ru/sites/default/files/styles/100per_x_100per/public/vinilovovyy_sayding_nordside_laplandiya_shafran_2.jpg?itok=L40bODqe"],
        price: 215,
        stock: 1,
        discount: 15,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Шафран"],
            ["Материал", "Виниловый"],
            ["Имитация", "Корабельная доска"],
            ["Длина,мм", "3050"],
            ["Ширина,мм", "205"]
        ]
    },
    {
        name: "Сайдинг NordSide Классика 3,85м х 0,23м Мятный",
        images: ["https://st30.stpulscen.ru/images/product/453/668/586_medium3.jpg", "https://st37.stpulscen.ru/images/product/449/946/073_original.jpg"],
        price: 310,
        stock: 1,
        discount: 0,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Мятный"],
            ["Материал", "Виниловый"],
            ["Имитация", "Дерево"],
            ["Длина,мм", "3850"],
            ["Ширина,мм", "230"]
        ]
    },
    {
        name: "Сайдинг NordSide Классика 3,85м х 0,23м Песочный",
        images: ["https://st30.stpulscen.ru/images/product/453/669/834_medium3.webp", "https://st37.stpulscen.ru/images/product/449/946/073_original.jpg"],
        price: 310,
        stock: 1,
        discount: 0,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Песочный"],
            ["Материал", "Виниловый"],
            ["Имитация", "Дерево"],
            ["Длина,мм", "3850"],
            ["Ширина,мм", "230"]
        ]
    },
    {
        name: "Сайдинг NordSide Классика 3,85м х 0,23м Сандаловое дерево",
        images: ["https://st30.stpulscen.ru/images/product/453/669/832_medium3.jpg", "https://st37.stpulscen.ru/images/product/449/946/073_original.jpg"],
        price: 310,
        stock: 1,
        discount: 0,
        description: "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics: [
            ["Страна-производитель", "Россия"],
            ["Производитель", "NordSide"],
            ["Цвет", "Сандаловое дерево"],
            ["Материал", "Виниловый"],
            ["Имитация", "Дерево"],
            ["Длина,мм", "3850"],
            ["Ширина,мм", "230"]
        ]
    },
    {
        name: "Сайдинг NordSide Классика 3,85м х 0,23м Серый",
        images:
            ["https://st30.stpulscen.ru/images/product/453/668/593_medium3.jpg", "https://st37.stpulscen.ru/images/product/449/946/073_original.jpg"],
        price:
            310,
        stock:
            1,
        discount:
            0,
        description:
            "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "NordSide"],
                ["Цвет", "Серый"],
                ["Материал", "Виниловый"],
                ["Имитация", "Дерево"],
                ["Длина,мм", "3850"],
                ["Ширина,мм", "230"]
            ]
    },
    {
        name:
            "Сайдинг NordSide Классика 3,85м х 0,23м Слоновая кость",
        images:
            ["https://st30.stpulscen.ru/images/product/453/668/588_medium3.jpg", "https://st37.stpulscen.ru/images/product/449/946/073_original.jpg"],
        price:
            310,
        stock:
            1,
        discount:
            0,
        description:
            "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "NordSide"],
                ["Цвет", "Слоновая кость"],
                ["Материал", "Виниловый"],
                ["Имитация", "Дерево"],
                ["Длина,мм", "3850"],
                ["Ширина,мм", "230"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Nordside Бревно 0,23 х 3,05м Шафран",
        images:
            ["https://st37.stpulscen.ru/images/product/453/077/325_original.jpg", "https://s.promindex.ru/files/images/product/large_image/116/1158594/sayding-nordsaid-laplandiya-brevno-305023_599f899ce031e.jpg"],
        price:
            295,
        stock:
            1,
        discount:
            10,
        description:
            "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "NordSide"],
                ["Цвет", "Шафран"],
                ["Материал", "Виниловый"],
                ["Имитация", "Бревно"],
                ["Длина,мм", "3050"],
                ["Ширина,мм", "230"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Nordside Бревно 0,23 х 3,05м Имбирь",
        images:
            ["https://st37.stpulscen.ru/images/product/453/077/606_medium3.jpg", "https://s.promindex.ru/files/images/product/large_image/116/1158594/sayding-nordsaid-laplandiya-brevno-305023_599f899ce031e.jpg"],
        price:
            295,
        stock:
            1,
        discount:
            10,
        description:
            "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "NordSide"],
                ["Цвет", "Имбирь"],
                ["Материал", "Виниловый"],
                ["Имитация", "Бревно"],
                ["Длина,мм", "3050"],
                ["Ширина,мм", "230"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Nordside Бревно 0,23 х 3,05м Корица",
        images:
            ["https://st37.stpulscen.ru/images/product/453/077/462_medium3.jpg", "https://s.promindex.ru/files/images/product/large_image/116/1158594/sayding-nordsaid-laplandiya-brevno-305023_599f899ce031e.jpg"],
        price:
            295,
        stock:
            1,
        discount:
            10,
        description:
            "Сайдинг NordSide производится из первичного сырья на совместном Российско-финском предприятии в г. Санкт-Петербурге. Обладает качествами сайдинга премиум-класса. Добавление в сайдинг качественных присадок УФ-фильтров и диоксида титана придает ему прочность и устойчивость к выгоранию. \n " +
            "Сайдинг производится по новейшим технологиям для использования в российских климатических условиях. Материал выдерживает значительные перепады температур (от -45° до +50°С), защищает фасад от атмосферных воздействий. Сайдинг долговечен, не подвержен коррозии и не поддерживает горения (самозатухающий материал).",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "NordSide"],
                ["Цвет", "Корица"],
                ["Материал", "Виниловый"],
                ["Имитация", "Бревно"],
                ["Длина,мм", "3050"],
                ["Ширина,мм", "230"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Blockhouse ВН01 однопереломный 3,10 x 0,20м",
        images:
            ["https://st15.stpulscen.ru/images/product/159/035/469_medium3.jpg", "https://st15.stpulscen.ru/images/product/159/037/630_medium3.jpg", "https://st15.stpulscen.ru/images/product/159/037/619_original.jpg"],
        price:
            400,
        stock:
            0,
        discount:
            0,
        description:
            "Стоимость уточняйте на текущий момент ввиду постоянных изменений цен поставщиков.",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "Альта Профиль"],
                ["Цвета", "Бежевый, Персиковый, Золотистый"],
                ["Материал", "Виниловый"],
                ["Имитация", "Бревно"],
                ["Длина,мм", "3100"],
                ["Ширина,мм", "200"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Blockhouse ВН02 двухпереломный 3,10 x 0,32м",
        images:
            ["https://ukrbyd.com/image/cache/catalog/BlockHouse/bej/BH_bej-500x500.jpg", "https://images.idd35.ru/10352127/normal", "https://ukrbyd.com/image/cache/catalog/BlockHouse/zol/BH_zol-228x228.jpg"],
        price:
            880,
        stock:
            0,
        discount:
            0,
        description:
            "Стоимость уточняйте на текущий момент ввиду постоянных изменений цен поставщиков.",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "Альта Профиль"],
                ["Цвета", "Бежевый, Персиковый, Золотистый"],
                ["Материал", "Виниловый"],
                ["Имитация", "Бревно"],
                ["Длина,мм", "3100"],
                ["Ширина,мм", "320"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Blockhouse ВН03 двухпереломный 3,10 x 0,226м",
        images:
            ["https://st49.stpulscen.ru/images/product/262/260/672_medium3.jpg", "https://st45.stpulscen.ru/images/product/248/470/703_original.jpg", "https://st49.stpulscen.ru/images/product/262/260/674_original.jpg", "https://st45.stpulscen.ru/images/product/248/470/702_original.jpg", "https://st45.stpulscen.ru/images/product/248/470/705_original.jpg"],
        price:
            250,
        stock:
            0,
        discount:
            0,
        description:
            "Стоимость уточняйте на текущий момент ввиду постоянных изменений цен поставщиков.",
        characteristics:
            [
                ["Страна-производитель", "Россия"],
                ["Производитель", "Альта Профиль"],
                ["Цвета", "Бук, Каштан, Ольха, Орех, Ясень"],
                ["Материал", "Акриловый"],
                ["Имитация", "Бревно"],
                ["Длина,мм", "3000"],
                ["Ширина,мм", "226"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Hokla Color 2,0 х 0,25м",
        images:
            ["https://st2.stpulscen.ru/images/product/416/211/425_original.png", "https://st2.stpulscen.ru/images/product/416/212/173_original.png", "https://st2.stpulscen.ru/images/product/416/211/870_original.png"],
        price:
            436,
        stock:
            0,
        discount:
            0,
        description:
            "Стоимость уточняйте на текущий момент ввиду постоянных изменений цен поставщиков.",
        characteristics:
            [
                ["Страна-производитель", "Беларусь"],
                ["Производитель", "Hokla"],
                ["Цвета", "Брусника, Голубика, Ирландский мох"],
                ["Материал", "Акриловый"],
                ["Имитация", "Дерево"],
                ["Длина,мм", "2000"],
                ["Ширина,мм", "250"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Hokla Винтаж 2,0 x 0,25м",
        images:
            ["https://st3.stpulscen.ru/images/product/413/366/965_medium3.png", "https://st3.stpulscen.ru/images/product/413/366/964_original.png", "https://st3.stpulscen.ru/images/product/413/366/959_original.png", "https://st3.stpulscen.ru/images/product/413/366/952_original.png"],
        price:
            436,
        stock:
            0,
        discount:
            0,
        description:
            "Стоимость уточняйте на текущий момент ввиду постоянных изменений цен поставщиков.",
        characteristics:
            [
                ["Страна-производитель", "Беларусь"],
                ["Производитель", "Hokla"],
                ["Цвета", "Солома, Пепел, Корица, Охра"],
                ["Материал", "Акриловый"],
                ["Имитация", "Дерево"],
                ["Длина,мм", "2000"],
                ["Ширина,мм", "250"]
            ]
    }
    ,
    {
        name:
            "Сайдинг Hokla Лиственница 2,0 х 0,25м",
        images:
            ["https://st30.stpulscen.ru/images/product/454/177/385_medium3.jpg", "https://st30.stpulscen.ru/images/product/454/177/387_original.jpg"],
        price:
            392,
        stock:
            0,
        discount:
            0,
        description:
            "Стоимость уточняйте на текущий момент ввиду постоянных изменений цен поставщиков.",
        characteristics:
            [
                ["Страна-производитель", "Беларусь"],
                ["Производитель", "Hokla"],
                ["Цвета", "Медовая, Светлая"],
                ["Материал", "Виниловый"],
                ["Имитация", "Дерево"],
                ["Длина,мм", "2000"],
                ["Ширина,мм", "250"]
            ]
    }
]